_posts/2021-06-05-write-post-in-org.html
---
layout: post
title: "Blogging with Orgmode and GitHub Pages"
tags: [emacs]
uuid: 4f1f640d-4d1a-4d7a-bc5e-fc016ae9a13b
---
{% include JB/setup %}

<div id="outline-container-org8465956" class="outline-2">
<h2 id="org8465956">Configure Org html Export</h2>
<div class="outline-text-2" id="text-org8465956">
<p>
add following setting to emacs init file and redefine <code>org-html-src-block</code> to transcode source
to <code>rouge</code> code block for jekyll highlighting.
</p>

{% highlight elisp %}
(setq org-html-htmlize-output-type 'nil)

(setq org-publish-project-alist
      '(("gh-pages"
	 :base-directory "/path/to/your/org/files/folder"
	 :base-extension "org"

	 ;; Path to your Jekyll project.
	 :publishing-directory "/path/to/your/gh-pages/_post"
	 :recursive t
	 :publishing-function org-publish-org-to-html
	 :headline-levels 4
	 :html-extension "html"
	 :body-only t ;; Only export section between body
	 )))

(defun org-html-src-block-jekyll (src-block contents info)
  "Transcode a SRC-BLOCK element from Org to Jekyll highlight block.
CONTENTS holds the contents of the item.  INFO is a plist holding
contextual information."
  (if (org-export-read-attribute :attr_html src-block :textarea)
      (org-html--textarea-block src-block)
    (let ((lang (or (org-element-property :language src-block) ""))
	  (code (org-html-format-code src-block info))
	  (label (let ((lbl (and (org-element-property :name src-block)
				 (org-export-get-reference src-block info))))
		   (if lbl (format " id=\"%s\"" lbl) ""))))
      ;; Build Rouge highlight code block
      ;; NOTE: here use concat instead format to avoid syntax error for rouge processing, while
      ;; in init.el using `format' is enough.
      (concat "{\% "
	      "highlight "
	      lang
	      " \%}\n"
	      code
	      "{\% "
	      "endhighlight"
	      "\%}\n"))))

(advice-add 'org-html-src-block :override 'org-html-src-block-jekyll)


{% endhighlight %}
</div>
</div>

<div id="outline-container-orgf63592c" class="outline-2">
<h2 id="orgf63592c">Export to Jekyll html</h2>
<div class="outline-text-2" id="text-orgf63592c">
<p>
export org file to html using command <code>C-c C-e P f</code> or <code>org-publish-current-file</code>.
Or use <code>C-u</code> prefix to publish forcedlly even the content is unmodified.
</p>
</div>
</div>

<div id="outline-container-org9e23d12" class="outline-2">
<h2 id="org9e23d12">Reference</h2>
<div class="outline-text-2" id="text-org9e23d12">
<ol class="org-ol">
<li><a href="https://carl.ac/blogging-with-emacs-org-github-pages/">https://carl.ac/blogging-with-emacs-org-github-pages/</a></li>
<li><a href="https://thackl.github.io/blogging-with-emacs-org-mode-and-jekyll">https://thackl.github.io/blogging-with-emacs-org-mode-and-jekyll</a></li>
<li><a href="https://orgmode.org/worg/org-tutorials/org-jekyll.html">https://orgmode.org/worg/org-tutorials/org-jekyll.html</a></li>
<li><a href="https://github.com/PhilipTrauner/pygments-github-css">https://github.com/PhilipTrauner/pygments-github-css</a></li>
</ol>
</div>
</div>
